# ShowOpening Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSurface..::..ShowOpening Method
AnalyticalModelSurface Class See Also
---
Shows previously hidden set of curves originating from Opening.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowOpening(
	ElementId openingId
)
```

Visual Basic
---
```text
Public Function ShowOpening ( _
	openingId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool ShowOpening(
	ElementId^ openingId
)
```

# ### Parameters
openingId
    Type: Autodesk.Revit.DB..::..ElementId Opening to show in analytical surface.
# ### Return Value
True if given opening was shown (operation was successful).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | openingId is invalid for Analytical Model Surface. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace